---
kind: method
id: M:Autodesk.Revit.DB.RuledSurface.HasSecondProfilePoint
source: html/056030c4-3d30-f9fb-fbaf-fa11763e2304.htm
---
# Autodesk.Revit.DB.RuledSurface.HasSecondProfilePoint Method

Checks if a point was used to define the second profile.

## Syntax (C#)
```csharp
public bool HasSecondProfilePoint()
```

## Returns
True if a point was used to define the second profile, false otherwise.